_src/wiki/2017-04-03-openssl.org
* QUICK START

To start, I created an RSA private key, and checked it:

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_privatekey.pem  -check
    RSA key ok
    writing RSA key
    -----BEGIN RSA PRIVATE KEY-----
    MIICXQIBAAKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4pOYWo+GeAEmU4N1HPZj1dxv70
    4hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyozC/zSqcuU6iBrvzDTpyG1zhIG
    76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknmLBrtZkLkBhchgYnMswIDAQAB
    AoGAQaJ5aivspeEXcpahWavzAFLv27+Tz48usUV+stY6arRhqbBEkV19/N5t8EPA
    01U6IGDQ8QIXEIW/rtsHKM6DAZhAbakPDJhJRatcMzJ08ryIkP/c3+onkTquiveG
    brw7xzn6Xa8ls04aQ6VQR4jxXUjV5bB72pFZnGRoAmS2NiECQQDUoISbmTGjnHM+
    kEfunNTXbNmKklwTYhyZaSVsSptnD7CvLWB4qB/g4h2/HjsELag6Z7SlWuYr7tba
    H3nBYn35AkEAykFRudMqlBy3XmcGIpjxOD+7huyViPoUpy3ui/Bj3GbqsbEAt9cR
    PyOJa1VFa2JqShta1Tdep8LJv1QvgvY7CwJBAML+al5gAXvwEGhB3RXg0fi2JFLG
    opZMFbpDCUTkrtu3MeuVC7HbTVDpTSpmSO0uCed2D97NG+USZgsnbnuBHdECQQCw
    S3FWPXdetQ0srzaMz61rLzphaDULuZhpBMNqnTYeNmMaUcPjewagd3Rf52rkKFun
    juKE+Yd7SXGbYWEskT5zAkAD7tbNwe5ryD2CT71jrY/5uXMR2yg/A4Ry2ocZkQUp
    iGflLrHnODvHO5LYLBlSKpjanBceYHJLuMFNZruf7uBM
    -----END RSA PRIVATE KEY-----
#+END_EXAMPLE

(Oh, horrors! I've exposed a private key. Meh...)

I extract and display its public key:

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_privatekey.pem -pubout
    writing RSA key
    -----BEGIN PUBLIC KEY-----
    MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
    OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
    C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
    LBrtZkLkBhchgYnMswIDAQAB
    -----END PUBLIC KEY-----
#+END_EXAMPLE

It so happens there's another public key output parameter (as is
mentioned in an earlier comment). I extract and display the public key
using that keyword instead:

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_privatekey.pem -RSAPublicKey_out
    writing RSA key
    -----BEGIN RSA PUBLIC KEY-----
    MIGJAoGBAKf86UWTu8tFDp0GI1CS+OeGbik5haj4Z4ASZTg3Uc9mPV3G/vTiGbzR
    5hzuHXbFzuhVwMsF0cHIYAYGlB+mOB0/KjML/NKpy5TqIGu/MNOnIbXOEgbvoqty
    N1tfo+UoA872v90JGZSKMWFWhSVjrLAaSeYsGu1mQuQGFyGBicyzAgMBAAE=
    -----END RSA PUBLIC KEY-----
#+END_EXAMPLE

Well, well. These two public key values aren't the same, though they're
derived from the same private key. Or are they the same? I cut and paste
the two public key strings into their own files, and then do a modulus
check on each:

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_publickey.pem -pubin -modulus
    Modulus=
    A7FCE94593BBCB450E9D06235092F8E7
    866E293985A8F867801265383751CF66
    3D5DC6FEF4E219BCD1E61CEE1D76C5CE
    E855C0CB05D1C1C8600606941FA6381D
    3F2A330BFCD2A9CB94EA206BBF30D3A7
    21B5CE1206EFA2AB72375B5FA3E52803
    CEF6BFDD0919948A316156852563ACB0
    1A49E62C1AED6642E40617218189CCB3
    writing RSA key
    -----BEGIN PUBLIC KEY-----
    MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
    OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
    C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
    LBrtZkLkBhchgYnMswIDAQAB
    -----END PUBLIC KEY-----
#+END_EXAMPLE

The 'pubin' tells rsa that this really is supposed to be a public key,
and don't complain that it's not a private key.

Now we take the RSA public key, display the modulus, and transmogrify it
into a plain old 'public key' (again, we have to tell it the input is a
public key):

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_rsapublickey.pem -RSAPublicKey_in -modulus
    Modulus=
    A7FCE94593BBCB450E9D06235092F8E7
    866E293985A8F867801265383751CF66
    3D5DC6FEF4E219BCD1E61CEE1D76C5CE
    E855C0CB05D1C1C8600606941FA6381D
    3F2A330BFCD2A9CB94EA206BBF30D3A7
    21B5CE1206EFA2AB72375B5FA3E52803
    CEF6BFDD0919948A316156852563ACB0
    1A49E62C1AED6642E40617218189CCB3
    writing RSA key
    -----BEGIN PUBLIC KEY-----
    MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
    OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
    C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
    LBrtZkLkBhchgYnMswIDAQAB
    -----END PUBLIC KEY-----
#+END_EXAMPLE

Same modulus, and same 'public key' value displayed. To make things more
interesting (for me, anyway), when we tack on the RSAPublicKey\_out
keyword we get:

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_rsapublickey.pem -RSAPublicKey_in -modulus -RSAPublicKey_out
    Modulus=
    A7FCE94593BBCB450E9D06235092F8E7
    866E293985A8F867801265383751CF66
    3D5DC6FEF4E219BCD1E61CEE1D76C5CE
    E855C0CB05D1C1C8600606941FA6381D
    3F2A330BFCD2A9CB94EA206BBF30D3A7
    21B5CE1206EFA2AB72375B5FA3E52803
    CEF6BFDD0919948A316156852563ACB0
    1A49E62C1AED6642E40617218189CCB3
    writing RSA key
    -----BEGIN RSA PUBLIC KEY-----
    MIGJAoGBAKf86UWTu8tFDp0GI1CS+OeGbik5haj4Z4ASZTg3Uc9mPV3G/vTiGbzR
    5hzuHXbFzuhVwMsF0cHIYAYGlB+mOB0/KjML/NKpy5TqIGu/MNOnIbXOEgbvoqty
    N1tfo+UoA872v90JGZSKMWFWhSVjrLAaSeYsGu1mQuQGFyGBicyzAgMBAAE=
    -----END RSA PUBLIC KEY-----
#+END_EXAMPLE

...and when we transmogrify the plain old 'public key' into an RSA
public key:

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_publickey.pem -pubin -RSAPublicKey_out
    writing RSA key
    -----BEGIN RSA PUBLIC KEY-----
    MIGJAoGBAKf86UWTu8tFDp0GI1CS+OeGbik5haj4Z4ASZTg3Uc9mPV3G/vTiGbzR
    5hzuHXbFzuhVwMsF0cHIYAYGlB+mOB0/KjML/NKpy5TqIGu/MNOnIbXOEgbvoqty
    N1tfo+UoA872v90JGZSKMWFWhSVjrLAaSeYsGu1mQuQGFyGBicyzAgMBAAE=
    -----END RSA PUBLIC KEY-----
#+END_EXAMPLE

...marching on relentlessly, and although we just did this a few
commands ago, to make the point we flip things around so the
transmogrification is from RSA to plain old 'public key':

#+BEGIN_EXAMPLE
    >openssl rsa -in newclient_rsapublickey.pem -RSAPublicKey_in -pubout
    writing RSA key
    -----BEGIN PUBLIC KEY-----
    MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
    OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
    C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
    LBrtZkLkBhchgYnMswIDAQAB
    -----END PUBLIC KEY-----
#+END_EXAMPLE

...which takes us right back where we started. What have we learned?

Summary: the keys internally are the same, they just look different. An
earlier comment pointed out the RSA key format was defined in PKCS#1,
and the plain old 'public key' format was defined in PKCS#8. However,
editing one form doesn't turn it into the other. Hopefully I've now
beaten this distinction to death.

In case there's still a spark of life left, though, let's flog this a
bit more and reference the certificate that was originally generated
with the RSA private key so long ago, examining its public key and
modulus:

#+BEGIN_EXAMPLE
    >openssl x509 -in newclient_cert.pem -pubkey -noout -modulus
    -----BEGIN PUBLIC KEY-----
    MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
    OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
    C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
    LBrtZkLkBhchgYnMswIDAQAB
    -----END PUBLIC KEY-----
    Modulus=
    A7FCE94593BBCB450E9D06235092F8E7
    866E293985A8F867801265383751CF66
    3D5DC6FEF4E219BCD1E61CEE1D76C5CE
    E855C0CB05D1C1C8600606941FA6381D
    3F2A330BFCD2A9CB94EA206BBF30D3A7
    21B5CE1206EFA2AB72375B5FA3E52803
    CEF6BFDD0919948A316156852563ACB0
    1A49E62C1AED6642E40617218189CCB3
#+END_EXAMPLE

...and they all lived happily ever after: the certificate has the same
modulus value as the RSA public key, RSA private key, and plain old
'public key'. The certificate contains the same plain old 'public key'
value that we saw earlier, although it was signed with a file marked as
an RSA private key. It's safe to say there's a consensus.

There's no 'RSAPublicKey\_out' equivalent keyword in the X509 quadrant
of the OpenSSL galaxy, so we can't try that, although the modulus value
is described as the "RSA key modulus" which I suppose is as close as
we'll get.

How this would all look with a DSA-signed certificate, I don't know.

I realize this doesn't answer the original question, but perhaps it
provides some useful background. If not, my apologies. At the very
least, things not to do and assumptions not to make.

No doubt one has noted the slightly irritating repetition of "writing
RSA key", when it's not doing any such thing. I assume what's meant is
that the rsa module recognizes the plain old public key as a true RSA
key, and that's why it keeps harping on "RSA key" (plus it is the rsa
module, after all). If I recall properly, the generic EVP\_PKEY
structure has a union for all the key types, with each key type having
its own special set of values (the helpfully named g, w, q, and other
consonants).

In conclusion, I note there was a complaint regarding programming &
development; now, every OpenSSL command obviously has corresponding
code, and if one wishes to explore all the wonders that is OpenSSL
programming today, the command line would seem a reasonable place to
start. In this particular case (as I'm using a recent cygwin at the
moment) one might start by reviewing \openssl-1.0.2f\apps\rsa.c and
(given one has a high tolerance for macros)
\openssl-1.0.2f\crypto\pem\pem\_all.c

