wiki/2017-04-03-openssl.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>openssl</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">openssl</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#openssl"><div class="category">openssl</div></a> </div>
<div class="char-counter">2017-04-03</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5b2d176">QUICK START</a></li>
<li><a href="#org0d6822b">OPENSSL by default generate Private</a></li>
<li><a href="#orgb60867f">OpenSSL 1.0.0生成p12、jks、crt等格式证书的命令个过程</a>
<ul>
<li><a href="#org58e64eb">此生成的证书可用于浏览器、java、tomcat、c++等。在此备忘！</a></li>
<li><a href="#org3e1ab1c">生成客户端文件：</a></li>
<li><a href="#orgac8390b">生成服务端文件：</a></li>
</ul>
</li>
<li><a href="#org23e4916">使用 openssl 生成证书</a>
<ul>
<li><a href="#orgd619f2b">一、openssl 简介</a></li>
<li><a href="#org1802b48">二、生成RSA密钥</a>
<ul>
<li><a href="#orgfd80d9e">生成RSA私钥</a></li>
<li><a href="#org906393b">生成RSA公钥</a></li>
<li><a href="#org3c1658e">将RSA私钥转换成PKCS8格式</a></li>
<li><a href="#org34c6e08">生成加密的 RSA 私钥</a></li>
<li><a href="#org6d59a92">解密 RSA 私钥</a></li>
</ul>
</li>
<li><a href="#org02d6989">三、生成自签名证书</a>
<ul>
<li><a href="#orgdbd0cf6">生成 RSA 私钥和自签名证书</a></li>
<li><a href="#org18f9699">使用 RSA 私钥生成自签名证书</a></li>
<li><a href="#org6539402">查看 Cert 证书细节</a></li>
<li><a href="#orge173231">转换 Cert 证书格式</a></li>
</ul>
</li>
<li><a href="#orgdaef872">四、生成签名请求及CA 签名</a>
<ul>
<li><a href="#orgd48ae34">使用 RSA私钥生成 CSR 签名请求</a></li>
<li><a href="#orgbe09f00">查看CSR 的细节</a></li>
<li><a href="#orgd08c464">使用 根CA 证书 对请求签发证书进行签发，生成 x509证书</a></li>
</ul>
</li>
<li><a href="#org5cd06c6">五、openssl 命令参考</a></li>
</ul>
</li>
<li><a href="#orgdb3f9a0">algid parse error, not a sequence</a></li>
<li><a href="#org03b9d59">OpenSSL 操作筆記 - 檔案格式轉換</a>
<ul>
<li><a href="#orgf120522">格式簡介</a>
<ul>
<li><a href="#org4129842">DER</a></li>
<li><a href="#org621e2c9">PEM</a></li>
<li><a href="#orgd902095">PKCS#7</a></li>
<li><a href="#org597bc27">PKCS#12 (PFX)</a></li>
</ul>
</li>
<li><a href="#orgda6a77c">格式轉換</a>
<ul>
<li><a href="#orgd9355ae">Certificate PEM 轉 DER</a></li>
<li><a href="#orgf0cd4ec">Certificate DER 轉 PEM</a></li>
<li><a href="#orgf32d72c">匯出 public key 指令</a></li>
<li><a href="#orgc13f90a">PKCS#1/PKCS#8 轉換</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc125945">Java Keytool 变通方法</a></li>
<li><a href="#org287ec65">OpenSSL 的使用详解</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org5b2d176" class="outline-2">
<h2 id="org5b2d176">QUICK START</h2>
<div class="outline-text-2" id="text-org5b2d176">
<p>
To start, I created an RSA private key, and checked it:
</p>

<pre class="example">
&gt;openssl rsa -in newclient_privatekey.pem  -check
RSA key ok
writing RSA key
-----BEGIN RSA PRIVATE KEY-----
MIICXQIBAAKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4pOYWo+GeAEmU4N1HPZj1dxv70
4hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyozC/zSqcuU6iBrvzDTpyG1zhIG
76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknmLBrtZkLkBhchgYnMswIDAQAB
AoGAQaJ5aivspeEXcpahWavzAFLv27+Tz48usUV+stY6arRhqbBEkV19/N5t8EPA
01U6IGDQ8QIXEIW/rtsHKM6DAZhAbakPDJhJRatcMzJ08ryIkP/c3+onkTquiveG
brw7xzn6Xa8ls04aQ6VQR4jxXUjV5bB72pFZnGRoAmS2NiECQQDUoISbmTGjnHM+
kEfunNTXbNmKklwTYhyZaSVsSptnD7CvLWB4qB/g4h2/HjsELag6Z7SlWuYr7tba
H3nBYn35AkEAykFRudMqlBy3XmcGIpjxOD+7huyViPoUpy3ui/Bj3GbqsbEAt9cR
PyOJa1VFa2JqShta1Tdep8LJv1QvgvY7CwJBAML+al5gAXvwEGhB3RXg0fi2JFLG
opZMFbpDCUTkrtu3MeuVC7HbTVDpTSpmSO0uCed2D97NG+USZgsnbnuBHdECQQCw
S3FWPXdetQ0srzaMz61rLzphaDULuZhpBMNqnTYeNmMaUcPjewagd3Rf52rkKFun
juKE+Yd7SXGbYWEskT5zAkAD7tbNwe5ryD2CT71jrY/5uXMR2yg/A4Ry2ocZkQUp
iGflLrHnODvHO5LYLBlSKpjanBceYHJLuMFNZruf7uBM
-----END RSA PRIVATE KEY-----
</pre>

<p>
(Oh, horrors! I've exposed a private key. Meh&#x2026;)
</p>

<p>
I extract and display its public key:
</p>

<pre class="example">
&gt;openssl rsa -in newclient_privatekey.pem -pubout
writing RSA key
-----BEGIN PUBLIC KEY-----
MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
LBrtZkLkBhchgYnMswIDAQAB
-----END PUBLIC KEY-----
</pre>

<p>
It so happens there's another public key output parameter (as is
mentioned in an earlier comment). I extract and display the public key
using that keyword instead:
</p>

<pre class="example">
&gt;openssl rsa -in newclient_privatekey.pem -RSAPublicKey_out
writing RSA key
-----BEGIN RSA PUBLIC KEY-----
MIGJAoGBAKf86UWTu8tFDp0GI1CS+OeGbik5haj4Z4ASZTg3Uc9mPV3G/vTiGbzR
5hzuHXbFzuhVwMsF0cHIYAYGlB+mOB0/KjML/NKpy5TqIGu/MNOnIbXOEgbvoqty
N1tfo+UoA872v90JGZSKMWFWhSVjrLAaSeYsGu1mQuQGFyGBicyzAgMBAAE=
-----END RSA PUBLIC KEY-----
</pre>

<p>
Well, well. These two public key values aren't the same, though they're
derived from the same private key. Or are they the same? I cut and paste
the two public key strings into their own files, and then do a modulus
check on each:
</p>

<pre class="example">
&gt;openssl rsa -in newclient_publickey.pem -pubin -modulus
Modulus=
A7FCE94593BBCB450E9D06235092F8E7
866E293985A8F867801265383751CF66
3D5DC6FEF4E219BCD1E61CEE1D76C5CE
E855C0CB05D1C1C8600606941FA6381D
3F2A330BFCD2A9CB94EA206BBF30D3A7
21B5CE1206EFA2AB72375B5FA3E52803
CEF6BFDD0919948A316156852563ACB0
1A49E62C1AED6642E40617218189CCB3
writing RSA key
-----BEGIN PUBLIC KEY-----
MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
LBrtZkLkBhchgYnMswIDAQAB
-----END PUBLIC KEY-----
</pre>

<p>
The 'pubin' tells rsa that this really is supposed to be a public key,
and don't complain that it's not a private key.
</p>

<p>
Now we take the RSA public key, display the modulus, and transmogrify it
into a plain old 'public key' (again, we have to tell it the input is a
public key):
</p>

<pre class="example">
&gt;openssl rsa -in newclient_rsapublickey.pem -RSAPublicKey_in -modulus
Modulus=
A7FCE94593BBCB450E9D06235092F8E7
866E293985A8F867801265383751CF66
3D5DC6FEF4E219BCD1E61CEE1D76C5CE
E855C0CB05D1C1C8600606941FA6381D
3F2A330BFCD2A9CB94EA206BBF30D3A7
21B5CE1206EFA2AB72375B5FA3E52803
CEF6BFDD0919948A316156852563ACB0
1A49E62C1AED6642E40617218189CCB3
writing RSA key
-----BEGIN PUBLIC KEY-----
MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
LBrtZkLkBhchgYnMswIDAQAB
-----END PUBLIC KEY-----
</pre>

<p>
Same modulus, and same 'public key' value displayed. To make things more
interesting (for me, anyway), when we tack on the RSAPublicKey\<sub>out</sub>
keyword we get:
</p>

<pre class="example">
&gt;openssl rsa -in newclient_rsapublickey.pem -RSAPublicKey_in -modulus -RSAPublicKey_out
Modulus=
A7FCE94593BBCB450E9D06235092F8E7
866E293985A8F867801265383751CF66
3D5DC6FEF4E219BCD1E61CEE1D76C5CE
E855C0CB05D1C1C8600606941FA6381D
3F2A330BFCD2A9CB94EA206BBF30D3A7
21B5CE1206EFA2AB72375B5FA3E52803
CEF6BFDD0919948A316156852563ACB0
1A49E62C1AED6642E40617218189CCB3
writing RSA key
-----BEGIN RSA PUBLIC KEY-----
MIGJAoGBAKf86UWTu8tFDp0GI1CS+OeGbik5haj4Z4ASZTg3Uc9mPV3G/vTiGbzR
5hzuHXbFzuhVwMsF0cHIYAYGlB+mOB0/KjML/NKpy5TqIGu/MNOnIbXOEgbvoqty
N1tfo+UoA872v90JGZSKMWFWhSVjrLAaSeYsGu1mQuQGFyGBicyzAgMBAAE=
-----END RSA PUBLIC KEY-----
</pre>

<p>
&#x2026;and when we transmogrify the plain old 'public key' into an RSA
public key:
</p>

<pre class="example">
&gt;openssl rsa -in newclient_publickey.pem -pubin -RSAPublicKey_out
writing RSA key
-----BEGIN RSA PUBLIC KEY-----
MIGJAoGBAKf86UWTu8tFDp0GI1CS+OeGbik5haj4Z4ASZTg3Uc9mPV3G/vTiGbzR
5hzuHXbFzuhVwMsF0cHIYAYGlB+mOB0/KjML/NKpy5TqIGu/MNOnIbXOEgbvoqty
N1tfo+UoA872v90JGZSKMWFWhSVjrLAaSeYsGu1mQuQGFyGBicyzAgMBAAE=
-----END RSA PUBLIC KEY-----
</pre>

<p>
&#x2026;marching on relentlessly, and although we just did this a few
commands ago, to make the point we flip things around so the
transmogrification is from RSA to plain old 'public key':
</p>

<pre class="example">
&gt;openssl rsa -in newclient_rsapublickey.pem -RSAPublicKey_in -pubout
writing RSA key
-----BEGIN PUBLIC KEY-----
MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
LBrtZkLkBhchgYnMswIDAQAB
-----END PUBLIC KEY-----
</pre>

<p>
&#x2026;which takes us right back where we started. What have we learned?
</p>

<p>
Summary: the keys internally are the same, they just look different. An
earlier comment pointed out the RSA key format was defined in PKCS#1,
and the plain old 'public key' format was defined in PKCS#8. However,
editing one form doesn't turn it into the other. Hopefully I've now
beaten this distinction to death.
</p>

<p>
In case there's still a spark of life left, though, let's flog this a
bit more and reference the certificate that was originally generated
with the RSA private key so long ago, examining its public key and
modulus:
</p>

<pre class="example">
&gt;openssl x509 -in newclient_cert.pem -pubkey -noout -modulus
-----BEGIN PUBLIC KEY-----
MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCn/OlFk7vLRQ6dBiNQkvjnhm4p
OYWo+GeAEmU4N1HPZj1dxv704hm80eYc7h12xc7oVcDLBdHByGAGBpQfpjgdPyoz
C/zSqcuU6iBrvzDTpyG1zhIG76KrcjdbX6PlKAPO9r/dCRmUijFhVoUlY6ywGknm
LBrtZkLkBhchgYnMswIDAQAB
-----END PUBLIC KEY-----
Modulus=
A7FCE94593BBCB450E9D06235092F8E7
866E293985A8F867801265383751CF66
3D5DC6FEF4E219BCD1E61CEE1D76C5CE
E855C0CB05D1C1C8600606941FA6381D
3F2A330BFCD2A9CB94EA206BBF30D3A7
21B5CE1206EFA2AB72375B5FA3E52803
CEF6BFDD0919948A316156852563ACB0
1A49E62C1AED6642E40617218189CCB3
</pre>

<p>
&#x2026;and they all lived happily ever after: the certificate has the same
modulus value as the RSA public key, RSA private key, and plain old
'public key'. The certificate contains the same plain old 'public key'
value that we saw earlier, although it was signed with a file marked as
an RSA private key. It's safe to say there's a consensus.
</p>

<p>
There's no 'RSAPublicKey\<sub>out</sub>' equivalent keyword in the X509 quadrant
of the OpenSSL galaxy, so we can't try that, although the modulus value
is described as the "RSA key modulus" which I suppose is as close as
we'll get.
</p>

<p>
How this would all look with a DSA-signed certificate, I don't know.
</p>

<p>
I realize this doesn't answer the original question, but perhaps it
provides some useful background. If not, my apologies. At the very
least, things not to do and assumptions not to make.
</p>

<p>
No doubt one has noted the slightly irritating repetition of "writing
RSA key", when it's not doing any such thing. I assume what's meant is
that the rsa module recognizes the plain old public key as a true RSA
key, and that's why it keeps harping on "RSA key" (plus it is the rsa
module, after all). If I recall properly, the generic EVP\<sub>PKEY</sub>
structure has a union for all the key types, with each key type having
its own special set of values (the helpfully named g, w, q, and other
consonants).
</p>

<p>
In conclusion, I note there was a complaint regarding programming &amp;
development; now, every OpenSSL command obviously has corresponding
code, and if one wishes to explore all the wonders that is OpenSSL
programming today, the command line would seem a reasonable place to
start. In this particular case (as I'm using a recent cygwin at the
moment) one might start by reviewing \openssl-1.0.2f\apps\rsa.c and
(given one has a high tolerance for macros)
\openssl-1.0.2f\crypto\pem\pem\<sub>all.c</sub>
</p>
</div>
</div>
