_src/wiki/2017-04-03-openssl.org
* OPENSSL by default generate Private

*OPENSSL by default generate Private Key in PKCS#1*

#+BEGIN_EXAMPLE
    -----BEGIN RSA PUBLIC KEY-----
    ...
    -----END RSA PUBLIC KEY-----
#+END_EXAMPLE

You can convert Private Key to PKCS#8 format and this is as follows

#+BEGIN_EXAMPLE
    -----BEGIN PRIVATE KEY-----
    ...
    -----END PRIVATE KEY-----
#+END_EXAMPLE

SSL Always export Public Key in X.509 format it's as follows

#+BEGIN_EXAMPLE
    -----BEGIN PUBLIC KEY-----
    ...
    -----END PUBLIC KEY-----
#+END_EXAMPLE

I use this bat script for generate RSA keypair.

#+BEGIN_EXAMPLE
    @ECHO OFF
    SET mypath=%~dp0
    cd %mypath:~0,-1%
    ECHO === GENERATE PRIVATE KEY in PKCS#1 format ===
    openssl genrsa -f4 -out private.txt 4096
    ECHO === EXPORT PUBLIC KEY ===
    openssl rsa -in private.txt -outform PEM -pubout -out public.txt
    ECHO === EXPORT PRIVATE KEY to PKCS#8 format ==
    openssl pkcs8 -topk8 -inform pem -in private.txt -outform PEM -nocrypt -out private8.txt
    PAUSE
#+END_EXAMPLE

* OpenSSL 1.0.0生成p12、jks、crt等格式证书的命令个过程

OpenSSL 1.0.0生成p12、jks、crt等格式证书的命令个过程

** 此生成的证书可用于浏览器、java、tomcat、c++等。在此备忘！

1. 创建根证私钥

   #+BEGIN_EXAMPLE
       openssl genrsa -out root-key.key 1024
   #+END_EXAMPLE

2. 创建根证书请求文件

   #+BEGIN_EXAMPLE
       openssl req -new -out root-req.csr -key root-key.key -keyform PEM
   #+END_EXAMPLE

3. 自签根证书
   =bash  openssl x509 -req -in root-req.csr -out root-cert.cer -signkey root-key.key -CAcreateserial -days 3650=
4. 导出p12格式根证书

   #+BEGIN_EXAMPLE
       openssl pkcs12 -export -clcerts -in root-cert.cer -inkey root-key.key -out root.p12
   #+END_EXAMPLE

5. 生成root.jks文件

   #+BEGIN_EXAMPLE
       keytool -import -v -trustcacerts -storepass 123456 -alias root -file root-cert.cer -keystore
       root.jks
   #+END_EXAMPLE

** 生成客户端文件：

1. 生成客户端key

   #+BEGIN_EXAMPLE
       openssl genrsa -out client-key.key 1024
   #+END_EXAMPLE

2. 生成客户端请求文件

   #+BEGIN_EXAMPLE
       openssl req -new -out client-req.csr -key client-key.key
   #+END_EXAMPLE

3. 生成客户端证书（root证书，rootkey，客户端key，客户端请求文件这4个生成客户端证书）

   #+BEGIN_EXAMPLE
       openssl x509 -req -in client-req.csr -out client-cert.cer -signkey client-key.key -CA root-cert.cer
       -CAkey root-key.key -CAcreateserial -days 3650
   #+END_EXAMPLE

4. 生成客户端p12格式根证书

   #+BEGIN_EXAMPLE
       openssl pkcs12 -export -clcerts -in client-cert.cer -inkey client-key.key -out client.p12
   #+END_EXAMPLE

   客户端jks：

   #+BEGIN_EXAMPLE
        keytool -import -v -trustcacerts -storepass 123456 -alias client -file client-cert.cer -keystore
       client.jks
   #+END_EXAMPLE

** 生成服务端文件：

1. 生成服务端key

   #+BEGIN_EXAMPLE
       openssl genrsa -out server-key.key 1024
   #+END_EXAMPLE

2. 生成服务端请求文件

   #+BEGIN_EXAMPLE
       openssl req -new -out server-req.csr -key server-key.key
   #+END_EXAMPLE

3. 生成服务端证书（root证书，rootkey，客户端key，客户端请求文件这4个生成客户端证书）

   #+BEGIN_EXAMPLE
       openssl x509 -req -in server-req.csr -out server-cert.cer -signkey server-key.key -CA root-cert.cer
       -CAkey root-key.key -CAcreateserial -days 3650
   #+END_EXAMPLE

4. 生成服务端p12格式根证书

   #+BEGIN_EXAMPLE
       openssl pkcs12 -export -clcerts -in server-cert.cer -inkey server-key.key -out server.p12
   #+END_EXAMPLE

   服务端JKS

   #+BEGIN_EXAMPLE
       keytool -import -v -trustcacerts -storepass 123456 -alias server -file server-cert.cer -keystore
       server.jks
   #+END_EXAMPLE

   无密码key命令：

   #+BEGIN_EXAMPLE
       openssl rsa -in client-key.key -out client-key.key.unsecure
   #+END_EXAMPLE

* 使用 openssl 生成证书

** 一、openssl 简介

目前最流行的 SSL 密码库工具 官网：https://www.openssl.org/source/

构成部分

密码算法库 密钥和证书封装管理功能 SSL通信API接口 用途

建立 RSA、DH、DSA key 参数 建立 X.509
证书、证书签名请求(CSR)和CRLs(证书回收列表) 计算消息摘要 使用各种
Cipher加密/解密 SSL/TLS 客户端以及服务器的测试 处理S/MIME 或者加密邮件

** 二、生成RSA密钥

*** 生成RSA私钥

#+BEGIN_EXAMPLE
    openssl genrsa -out rsa_private_key.pem 1024
#+END_EXAMPLE

*** 生成RSA公钥

#+BEGIN_EXAMPLE
    openssl rsa -in rsa_private_key.pem -pubout -out rsa_public_key.pem
#+END_EXAMPLE

*** 将RSA私钥转换成PKCS8格式

#+BEGIN_EXAMPLE
    openssl pkcs8 -topk8 -inform PEM -in rsa_private_key.pem -outform PEM -nocrypt
#+END_EXAMPLE

*** 生成加密的 RSA 私钥

#+BEGIN_EXAMPLE
    openssl genrsa -out rsa_desprv_key.pem 1024 -des3 -passout pass:111111
#+END_EXAMPLE

*** 解密 RSA 私钥

#+BEGIN_EXAMPLE
    openssl rsa -in rsa_desprv_key.pem -out rsa_nodesprv_key.pem -passin pass:111111
#+END_EXAMPLE

-passin; -passout 用于指定密码参数，若不包括则会弹出提示要求输入

** 三、生成自签名证书

*** 生成 RSA 私钥和自签名证书

#+BEGIN_EXAMPLE
    openssl req -x509 -nodes -days 365 -newkey rsa:1024 -keyout private_key.pem -out cert.crt
#+END_EXAMPLE

-nodes 指不采用des 加密

*** 使用 RSA 私钥生成自签名证书

#+BEGIN_EXAMPLE
    openssl req -new -x509 -days 3650 -key private_key.pem -out cert.crt
#+END_EXAMPLE

*** 查看 Cert 证书细节

#+BEGIN_EXAMPLE
    openssl x509 -in cert.crt -noout -text
#+END_EXAMPLE

*** 转换 Cert 证书格式

#+BEGIN_EXAMPLE
    openssl x509 -in cert.cer -inform DER -outform PEM -out cert.pem
#+END_EXAMPLE

** 四、生成签名请求及CA 签名

*** 使用 RSA私钥生成 CSR 签名请求

#+BEGIN_EXAMPLE
    openssl req -new -key private_key.pem -out cert.csr
#+END_EXAMPLE

此时生成的 csr签名请求文件可提交至 CA进行签发

*** 查看CSR 的细节

#+BEGIN_EXAMPLE
    openssl req -noout -text -in server.csr
#+END_EXAMPLE

*** 使用 根CA 证书 对请求签发证书进行签发，生成 x509证书

#+BEGIN_EXAMPLE
    openssl x509 -req -days 3650 -in server.csr -CA ca.crt -CAkey ca.key -CAcreateserial -out server.crt
#+END_EXAMPLE

CA 使用自有的证书(经过认证)及自有的私钥进行证书签署 ca.crt 为 ca
证书，ca.key 为 ca 的私钥

