wiki/2017-04-03-openssl.html

<div id="outline-container-org0d6822b" class="outline-2">
<h2 id="org0d6822b">OPENSSL by default generate Private</h2>
<div class="outline-text-2" id="text-org0d6822b">
<p>
<b>OPENSSL by default generate Private Key in PKCS#1</b>
</p>

<pre class="example">
-----BEGIN RSA PUBLIC KEY-----
...
-----END RSA PUBLIC KEY-----
</pre>

<p>
You can convert Private Key to PKCS#8 format and this is as follows
</p>

<pre class="example">
-----BEGIN PRIVATE KEY-----
...
-----END PRIVATE KEY-----
</pre>

<p>
SSL Always export Public Key in X.509 format it's as follows
</p>

<pre class="example">
-----BEGIN PUBLIC KEY-----
...
-----END PUBLIC KEY-----
</pre>

<p>
I use this bat script for generate RSA keypair.
</p>

<pre class="example">
@ECHO OFF
SET mypath=%~dp0
cd %mypath:~0,-1%
ECHO === GENERATE PRIVATE KEY in PKCS#1 format ===
openssl genrsa -f4 -out private.txt 4096
ECHO === EXPORT PUBLIC KEY ===
openssl rsa -in private.txt -outform PEM -pubout -out public.txt
ECHO === EXPORT PRIVATE KEY to PKCS#8 format ==
openssl pkcs8 -topk8 -inform pem -in private.txt -outform PEM -nocrypt -out private8.txt
PAUSE
</pre>
</div>
</div>

<div id="outline-container-orgb60867f" class="outline-2">
<h2 id="orgb60867f">OpenSSL 1.0.0生成p12、jks、crt等格式证书的命令个过程</h2>
<div class="outline-text-2" id="text-orgb60867f">
<p>
OpenSSL 1.0.0生成p12、jks、crt等格式证书的命令个过程
</p>
</div>

<div id="outline-container-org58e64eb" class="outline-3">
<h3 id="org58e64eb">此生成的证书可用于浏览器、java、tomcat、c++等。在此备忘！</h3>
<div class="outline-text-3" id="text-org58e64eb">
<ol class="org-ol">
<li><p>
创建根证私钥
</p>

<pre class="example">
openssl genrsa -out root-key.key 1024
</pre></li>

<li><p>
创建根证书请求文件
</p>

<pre class="example">
openssl req -new -out root-req.csr -key root-key.key -keyform PEM
</pre></li>

<li>自签根证书
<code>bash  openssl x509 -req -in root-req.csr -out root-cert.cer -signkey root-key.key -CAcreateserial -days 3650</code></li>
<li><p>
导出p12格式根证书
</p>

<pre class="example">
openssl pkcs12 -export -clcerts -in root-cert.cer -inkey root-key.key -out root.p12
</pre></li>

<li><p>
生成root.jks文件
</p>

<pre class="example">
keytool -import -v -trustcacerts -storepass 123456 -alias root -file root-cert.cer -keystore
root.jks
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-org3e1ab1c" class="outline-3">
<h3 id="org3e1ab1c">生成客户端文件：</h3>
<div class="outline-text-3" id="text-org3e1ab1c">
<ol class="org-ol">
<li><p>
生成客户端key
</p>

<pre class="example">
openssl genrsa -out client-key.key 1024
</pre></li>

<li><p>
生成客户端请求文件
</p>

<pre class="example">
openssl req -new -out client-req.csr -key client-key.key
</pre></li>

<li><p>
生成客户端证书（root证书，rootkey，客户端key，客户端请求文件这4个生成客户端证书）
</p>

<pre class="example">
openssl x509 -req -in client-req.csr -out client-cert.cer -signkey client-key.key -CA root-cert.cer
-CAkey root-key.key -CAcreateserial -days 3650
</pre></li>

<li><p>
生成客户端p12格式根证书
</p>

<pre class="example">
openssl pkcs12 -export -clcerts -in client-cert.cer -inkey client-key.key -out client.p12
</pre>

<p>
客户端jks：
</p>

<pre class="example">
 keytool -import -v -trustcacerts -storepass 123456 -alias client -file client-cert.cer -keystore
client.jks
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-orgac8390b" class="outline-3">
<h3 id="orgac8390b">生成服务端文件：</h3>
<div class="outline-text-3" id="text-orgac8390b">
<ol class="org-ol">
<li><p>
生成服务端key
</p>

<pre class="example">
openssl genrsa -out server-key.key 1024
</pre></li>

<li><p>
生成服务端请求文件
</p>

<pre class="example">
openssl req -new -out server-req.csr -key server-key.key
</pre></li>

<li><p>
生成服务端证书（root证书，rootkey，客户端key，客户端请求文件这4个生成客户端证书）
</p>

<pre class="example">
openssl x509 -req -in server-req.csr -out server-cert.cer -signkey server-key.key -CA root-cert.cer
-CAkey root-key.key -CAcreateserial -days 3650
</pre></li>

<li><p>
生成服务端p12格式根证书
</p>

<pre class="example">
openssl pkcs12 -export -clcerts -in server-cert.cer -inkey server-key.key -out server.p12
</pre>

<p>
服务端JKS
</p>

<pre class="example">
keytool -import -v -trustcacerts -storepass 123456 -alias server -file server-cert.cer -keystore
server.jks
</pre>

<p>
无密码key命令：
</p>

<pre class="example">
openssl rsa -in client-key.key -out client-key.key.unsecure
</pre></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org23e4916" class="outline-2">
<h2 id="org23e4916">使用 openssl 生成证书</h2>
<div class="outline-text-2" id="text-org23e4916">
</div>
<div id="outline-container-orgd619f2b" class="outline-3">
<h3 id="orgd619f2b">一、openssl 简介</h3>
<div class="outline-text-3" id="text-orgd619f2b">
<p>
目前最流行的 SSL 密码库工具 官网：<a href="https://www.openssl.org/source/">https://www.openssl.org/source/</a>
</p>

<p>
构成部分
</p>

<p>
密码算法库 密钥和证书封装管理功能 SSL通信API接口 用途
</p>

<p>
建立 RSA、DH、DSA key 参数 建立 X.509
证书、证书签名请求(CSR)和CRLs(证书回收列表) 计算消息摘要 使用各种
Cipher加密/解密 SSL/TLS 客户端以及服务器的测试 处理S/MIME 或者加密邮件
</p>
</div>
</div>

<div id="outline-container-org1802b48" class="outline-3">
<h3 id="org1802b48">二、生成RSA密钥</h3>
<div class="outline-text-3" id="text-org1802b48">
</div>
<div id="outline-container-orgfd80d9e" class="outline-4">
<h4 id="orgfd80d9e">生成RSA私钥</h4>
<div class="outline-text-4" id="text-orgfd80d9e">
<pre class="example">
openssl genrsa -out rsa_private_key.pem 1024
</pre>
</div>
</div>

<div id="outline-container-org906393b" class="outline-4">
<h4 id="org906393b">生成RSA公钥</h4>
<div class="outline-text-4" id="text-org906393b">
<pre class="example">
openssl rsa -in rsa_private_key.pem -pubout -out rsa_public_key.pem
</pre>
</div>
</div>

<div id="outline-container-org3c1658e" class="outline-4">
<h4 id="org3c1658e">将RSA私钥转换成PKCS8格式</h4>
<div class="outline-text-4" id="text-org3c1658e">
<pre class="example">
openssl pkcs8 -topk8 -inform PEM -in rsa_private_key.pem -outform PEM -nocrypt
</pre>
</div>
</div>

<div id="outline-container-org34c6e08" class="outline-4">
<h4 id="org34c6e08">生成加密的 RSA 私钥</h4>
<div class="outline-text-4" id="text-org34c6e08">
<pre class="example">
openssl genrsa -out rsa_desprv_key.pem 1024 -des3 -passout pass:111111
</pre>
</div>
</div>

<div id="outline-container-org6d59a92" class="outline-4">
<h4 id="org6d59a92">解密 RSA 私钥</h4>
<div class="outline-text-4" id="text-org6d59a92">
<pre class="example">
openssl rsa -in rsa_desprv_key.pem -out rsa_nodesprv_key.pem -passin pass:111111
</pre>

<p>
-passin; -passout 用于指定密码参数，若不包括则会弹出提示要求输入
</p>
</div>
</div>
</div>

<div id="outline-container-org02d6989" class="outline-3">
<h3 id="org02d6989">三、生成自签名证书</h3>
<div class="outline-text-3" id="text-org02d6989">
</div>
<div id="outline-container-orgdbd0cf6" class="outline-4">
<h4 id="orgdbd0cf6">生成 RSA 私钥和自签名证书</h4>
<div class="outline-text-4" id="text-orgdbd0cf6">
<pre class="example">
openssl req -x509 -nodes -days 365 -newkey rsa:1024 -keyout private_key.pem -out cert.crt
</pre>

<p>
-nodes 指不采用des 加密
</p>
</div>
</div>

<div id="outline-container-org18f9699" class="outline-4">
<h4 id="org18f9699">使用 RSA 私钥生成自签名证书</h4>
<div class="outline-text-4" id="text-org18f9699">
<pre class="example">
openssl req -new -x509 -days 3650 -key private_key.pem -out cert.crt
</pre>
</div>
</div>

<div id="outline-container-org6539402" class="outline-4">
<h4 id="org6539402">查看 Cert 证书细节</h4>
<div class="outline-text-4" id="text-org6539402">
<pre class="example">
openssl x509 -in cert.crt -noout -text
</pre>
</div>
</div>

<div id="outline-container-orge173231" class="outline-4">
<h4 id="orge173231">转换 Cert 证书格式</h4>
<div class="outline-text-4" id="text-orge173231">
<pre class="example">
openssl x509 -in cert.cer -inform DER -outform PEM -out cert.pem
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdaef872" class="outline-3">
<h3 id="orgdaef872">四、生成签名请求及CA 签名</h3>
<div class="outline-text-3" id="text-orgdaef872">
</div>
<div id="outline-container-orgd48ae34" class="outline-4">
<h4 id="orgd48ae34">使用 RSA私钥生成 CSR 签名请求</h4>
<div class="outline-text-4" id="text-orgd48ae34">
<pre class="example">
openssl req -new -key private_key.pem -out cert.csr
</pre>

<p>
此时生成的 csr签名请求文件可提交至 CA进行签发
</p>
</div>
</div>

<div id="outline-container-orgbe09f00" class="outline-4">
<h4 id="orgbe09f00">查看CSR 的细节</h4>
<div class="outline-text-4" id="text-orgbe09f00">
<pre class="example">
openssl req -noout -text -in server.csr
</pre>
</div>
</div>

<div id="outline-container-orgd08c464" class="outline-4">
<h4 id="orgd08c464">使用 根CA 证书 对请求签发证书进行签发，生成 x509证书</h4>
<div class="outline-text-4" id="text-orgd08c464">
<pre class="example">
openssl x509 -req -days 3650 -in server.csr -CA ca.crt -CAkey ca.key -CAcreateserial -out server.crt
</pre>

<p>
CA 使用自有的证书(经过认证)及自有的私钥进行证书签署 ca.crt 为 ca
证书，ca.key 为 ca 的私钥
</p>
</div>
</div>
</div>
