_src/wiki/2017-04-03-openssl.org
* algid parse error, not a sequence

1. java rsa秘钥加密出错：algid parse error, not a sequence

   #+BEGIN_EXAMPLE
        Exception in thread "main" java.security.spec.InvalidKeySpecException:         java.security.InvalidKeyException: IOException : algid parse error, not a       sequence
        at sun.security.rsa.RSAKeyFactory.engineGeneratePrivate(Unknown Source)
        at java.security.KeyFactory.generatePrivate(Unknown Source)
        at base54.encrypt.RSAToy.main(RSAToy.java:36)
        Caused by: java.security.InvalidKeyException: IOException : algid parse        error, not a sequence
        at sun.security.pkcs.PKCS8Key.decode(Unknown Source)
        at sun.security.pkcs.PKCS8Key.decode(Unknown Source)
        at sun.security.rsa.RSAPrivateCrtKeyImpl.(Unknown Source)
        at sun.security.rsa.RSAPrivateCrtKeyImpl.newKey(Unknown Source)
        at sun.security.rsa.RSAKeyFactory.generatePrivate(Unknown Source)
   #+END_EXAMPLE

2. 根据以上错误信息，很可能是你的秘钥文件格式问题（PKCS#1这种格式），你可以按照以下方法将秘钥文件改为PKCS#8。

   #+BEGIN_EXAMPLE
       openssl pkcs8 -topk8 -inform PEM -outform PEM -in 你的秘钥文件.pem -out
       输出秘钥文件.pem -nocrypt
   #+END_EXAMPLE

3. 然后按照之前的方法，读取新的秘钥文件，应该就可以了。

* OpenSSL 操作筆記 - 檔案格式轉換

** 格式簡介

Certificate 和 key 可以存成多種格式, 常見的有 DER , PEM , PFX

*** DER

將 certificate 或 key 用 DER ASN.1 編碼的原始格式, certificate
就是依照X.509的方式編碼, key 則是又能分為PKCS#1 和PKCS#8

*** PEM

把 DER 格式的 certificate 或 key 使用 base64-encoded
編碼後在頭尾補上資料標明檔案類型

#+BEGIN_EXAMPLE
    Certificate
    -----BEGIN PRIVATE KEY-----
    ...
    -----END PRIVATE KEY-----

    RSA private key (PKCS#1)
    -----BEGIN RSA PRIVATE KEY-----
    -----END RSA PRIVATE KEY-----

    RSA public key (PKCS#1)
    -----BEGIN RSA PUBLIC KEY-----
    ...
    -----END RSA PUBLIC KEY-----

    RSA private key (PKCS#8, key 沒加密 )
    -----BEGIN PRIVATE KEY-----
    ...
    -----END PRIVATE KEY-----

    RSA public key (PKCS#8)
    -----BEGIN PUBLIC KEY-----
    ...
    -----END PUBLIC KEY-----

    RSA private key (PKCS#8, key 有加密 )
    -----BEGIN ENCRYPTED PRIVATE KEY-----
    ...
    -----END ENCRYPTED PRIVATE KEY-----
#+END_EXAMPLE

*** PKCS#7

這個格式用來傳遞簽署過或加密的資料,檔案裡可以包含整個用到的 certificate
chain

*** PKCS#12 (PFX)

這個格式可以把 private key和整個 certificate chain 存程一個檔案

** 格式轉換

openssl 預設輸入輸出的格式都是PEM, 要轉換格式很簡單,搭配 inform, outform
參數就可以了

*** Certificate PEM 轉 DER

#+BEGIN_EXAMPLE
    openssl x509 -in cert.pem -outform der -out cert.der
#+END_EXAMPLE

*** Certificate DER 轉 PEM

#+BEGIN_EXAMPLE
    openssl x509 -inform der -in cert.der -outform der -out cert.pem
#+END_EXAMPLE

RSA key 的轉換比較多一些, 有 private/public key, PKCS#1/PKCS#8, DER/PEM,
以下只都是用 PEM 格式, 要換 DER 只要加入 inform, outform 參數就可以了

*** 匯出 public key 指令

從 certificate 匯出

#+BEGIN_EXAMPLE
    openssl x509 -in cert.pem -pubkey -noout > public.pem
#+END_EXAMPLE

從 private key 匯出

#+BEGIN_EXAMPLE
    openssl rsa -in private.pem -pubout -out public.pem
#+END_EXAMPLE

*** PKCS#1/PKCS#8 轉換

openssl 有多個指令會產生 private
key,genpkey會產生PKCS#8格式genrsa會產生PKCS#1格式, 上面兩個匯出 public
key的指令都是PKCS#8格式

Public key 格式轉換,主要是搭配 RSAPublicKey\_in,RSAPublicKey\_out,
這兩個參數, rsa command的 help沒有顯示這兩個參數,說明文件才有

1. Public key: PKCS#8 -> PKCS#1

   #+BEGIN_EXAMPLE
       openssl rsa -pubin -in public.pem -RSAPublicKey_out -out public_pkcs1.pem
   #+END_EXAMPLE

2. Public key: PKCS#1 -> PKCS#8

   #+BEGIN_EXAMPLE
       openssl rsa  -RSAPublicKey_in -in public_pkcs1.pem  -out public_pkcs8.pem
   #+END_EXAMPLE

   也可以在從 private key 匯出時直接設定輸出格式

   #+BEGIN_EXAMPLE
       openssl rsa -in private.pem -RSAPublicKey_out -out public_pkcs1.pem
   #+END_EXAMPLE

   Private key
   格式轉換,主要是用pkcs8指令,搭配topk8參數作轉換,若不加密就再補上nocrypt

3. Private key: PKCS#1 -> PKCS#8

   #+BEGIN_EXAMPLE
       openssl pkcs8 -in private_pkcs1.pem -topk8 -nocrypt -out private_pkcs8.pem
   #+END_EXAMPLE

4. Private key: PKCS#8 -> PKCS#1

   #+BEGIN_EXAMPLE
       openssl pkcs8 -in private_pkcs8.pem -nocrypt -out private_pkcs1.pem
   #+END_EXAMPLE

   用OpenSSL
   0.9.8可以,之後的版本用pkcs8這個指令輸出都是PKCS#8,這指令只是用於0.9.8

用0.9.8之後的版本直接用rsa轉檔即可

#+BEGIN_EXAMPLE
    openssl rsa -in private_pkcs8.pem -out private_pkcs1.pem
#+END_EXAMPLE

5. 從 PKCS#7 匯出 certificate 目前最常遇到的是 DOCSIS secure upgrade
   用的 Code File, 前面會有一段 DER 編碼的資料, 包含1～2張CVC

   #+BEGIN_EXAMPLE
       openssl pkcs7 -in code.p7b -print_certs -out certs.pem
   #+END_EXAMPLE

6. 從 PKCS#12(PFS) 匯出 certificate 和 private key

   #+BEGIN_EXAMPLE
       openssl pkcs12 -in key_cert.pfx -nodes -out key_cert.pem
   #+END_EXAMPLE

   打完指令會要求輸入 pfx file
   的密碼,若上述指令沒加入nodes,會再要求輸入匯出的 private key
   要用的密碼

7. 把 private key 和 certificate 以及 CA 打包成 PKCS#12
   這功能我是用來製作 FreeRADIUS client 端,給 windows 用的懶人包,輸入的
   private key (client.key), certificate (client.crt),
   certificate-chain(cert-chain.crt) 都是用 PEM 格式

   #+BEGIN_EXAMPLE
       openssl pkcs12 -export -out client.p12 -inkey client.key -in client.crt -certfile cert-chain.crt
   #+END_EXAMPLE

   打完指令會要求輸入 pfx file 的密碼, 之後在 windows下直接開啟
   client.p12 敲完密碼,下一步到底,憑證就會放到對的地方了

* Java Keytool 变通方法

缺省情况下，Java Keytool
不提供用于导出专用密钥的直接方法。但是，如果您的实用程序版本支持将 JKS
类型的密钥库导出为其他密钥库格式，那么您可以应用以下变通方法。
关于此任务 注： 如果您的 Keytool
不支持此密钥库导出，那么可以应用上一部分中的方法。 要使用 Java Keytool
导出： 在以下示例中，JKS 密钥库将导出为 Tealeaf® 可使用的 pkcs12。 过程
将密钥库导出到其他密钥库。在以下示例中，将使用单个命令将密钥库导出为
pkcs12 类型：

#+BEGIN_EXAMPLE
    keytool -importkeystore -srckeystore test-app.keystore
    -destkeystore mystore.p12 -srcstoretype JKS -deststoretype PKCS12
    -srcstorepass test-app-pwd -deststorepass test-app-pwd
    -srcalias test-app -destalias test-app -srckeypass test-app-pwd
    -destkeypass test-app-pwd -noprompt
#+END_EXAMPLE

其中： test-app.keystore = 应用程序密钥库的路径 mystore.p12 = 目标
pkcs12 密钥库的路径 JKS = 源密钥库类型。必须设置为 JKS。 PKCS12 =
目标密钥库类型。导出至 pkcs12 时必须设置为 PKCS12。 test-app-pwd =
密钥库的密码可以用于源密钥库和密钥密码，并且目标密钥库可以使用相同值。
test-app = 密钥库的别名对于源和目标可以相同。 当密钥库导出为 PKCS12
时，您使用 openssl 来从 pkcs12 格式化的密钥文件导出专用密钥： openssl
pkcs12 -in mystore.p12 -out mystore.pem\\
-passin pass:test-app-pwd -passout pass:test-app-pwd
受密码保护的专用密钥现在包含于 mystore.pem 中。 此专用密钥可以由 Tealeaf
使用。 有关验证 PEM 密钥的更多信息，请参阅生成自签名证书。
有关导入密钥的更多信息，请参阅已加密的 SSL 密钥设置。

* OpenSSL 的使用详解
